<?php 
error_reporting(E_ALL);
require_once "functions.php";

// показывать или нет выполненные задачи
$show_complete_tasks = rand(0, 1);

$task_list = [["Задача" => "Собеседование в IT компании", "Дата выполнения" => "01.06.2018", "Категория" => "Работа", "Выполнен" => false],
              ["Задача" => "Выполнить тестовое задание", "Дата выполнения" => "25.05.2018", "Категория" => "Работа", "Выполнен" => false],
              ["Задача" => "Сделать задание первого раздела", "Дата выполнения" => "21.04.2018", "Категория" => "Учеба", "Выполнен" => true],
              ["Задача" => "Встреча с другом", "Дата выполнения" => "22.04.2018", "Категория" => "Входящие", "Выполнен" => false],
              ["Задача" => "Купить корм для кота", "Дата выполнения" => "-", "Категория" => "Домашние дела", "Выполнен" => false],
              ["Задача" => "Заказать пиццу", "Дата выполнения" => "-", "Категория" => "Домашние дела", "Выполнен" => false]];

$page_content = renderTemplate('templates/index.php', ["tasks" => $task_list, "complete_tasks" => $show_complete_tasks]);

$layout_content = renderTemplate('templates/layout.php', ["content" => $page_content, "title" => "Дела в порядке!", "user_name" => "Константин"]);

print($layout_content);

?>